# Длина названий.
NAME_LENGTH = 256
# Длина коротких названий.
SHORT_NAME_LENGTH = 128
# Длина ед.измерения.
UNIT_NAME_LENGTH = 64
# Длмнв тэга.
TAG_LENGTH = 32
# Длина юзернейма, фамилии и имени.
USERNAME_LENGTH = 150
# Максимальная длина имени в админке.
MAX_ADMIN_NAME_LENGTH = 25
# Максимальная длина почты.
MAIL_LENGTH = 254
# Количество выводимых рецептов, если не передан параметр.
RECIPES_LIMIT = 6
# Длина короткой ссылки.
S_LINK_LENGTH = 3
# Минимально время приготовления рецепта.
COOKING_TIME = 1
# Минимальное количество ингредиента.
INGREDIENT_AMOUNT = 1
# Количество развернутых полей ингедиента.
ADMIN_EXTRA_FIELDS = 1
# Константа для страницы /me.
ACTION_ME = 'me'
# Регулярное выражение для валидации.
REGEX_VALIDATION = r'^[\w.@+-]+\Z'
# Исходное значение пагинации
PAGE_SIZE = 6
# Параметр для типа пагинации.
PAGE_QUERY_PARAM = 'limit'
